Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/* =============================================================================
 * Startup Flag Check Helpers
 * =============================================================================
 */

/**
 * @brief Check Power-On Reset Detect Flag (PORF) in RSTSR0 register
 *
 * @details
 * Reads the **RSTSR0 register** to determine if the current boot was initiated by a
 * **power-on reset** (fresh power application, not warm boot or software reset).
 *
 * ## PORF (Power-On Reset Flag) Semantics
 *
 * | PORF Value | Meaning | Boot Type | Expected? |
 * |------------|---------|-----------|-----------|
 * | **1 (set)** | Power-on reset occurred | **Cold start** | [OK] on fresh boot |
 * | **0 (clear)** | No power-on reset | **Warm start** | [WARN] Software reset, watchdog, or debugger |
 *
 * ## Register Details
 *
 * **RSTSR0 (Reset Status Register 0):**
 * - **Address:** 0x000C001C (accessed via `rstsr01()->rstsr0`)
 * - **Bit 0 (PORF):** Power-On Reset Detect Flag
 *   - Set by hardware on VCC power-on
 *   - Cleared by software write (requires PRCR.PRC0=1 protection unlock)
 *   - Persistent across warm boots until explicitly cleared
 *
 * ## Use Cases and Interpretation
 *
 * **Cold start (PORF=1):**
 * - Expected on normal power-up
 * - Flash memory state unknown (may contain prior data)
 * - All peripherals reset to default state
 * - Typical after power connection, power cycle
 *
 * **Warm start (PORF=0):**
 * - Software reset (via SWRR register write)
 * - Watchdog timeout reset (WDT or IWDT)
 * - Debugger-initiated reset (OpenOCD, GDB)
 * - Voltage monitoring reset (LVD)
 *
 * **Key insight:** PORF=0 is **not an error** - it's informational. Many valid scenarios
 * produce warm boots (bootloader software reset, debugger attach, etc.).
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Register read (rstsr0) | ~0.5 us | Single 8-bit read |
 * | Bit masking (& k_rstsr0_porf) | ~5 cycles | Bitwise AND |
 * | Conditional logging | ~5 us | If warm boot detected (UART output) |
 * | **Total** | **~0.5 us** | No logging (cold start) |
 *
 * @return bool Power-on reset detection status
 * @retval true PORF is set (cold start - power-on reset occurred)
 * @retval false PORF is clear (warm start - no power-on reset)
 *
 * @pre RSTSR0 register accessible (memory-mapped I/O at valid address)
 * @pre Register pointer (rstsr01()) returns non-NULL compile-time constant
 *
 * @post Return value reflects actual PORF bit state
 * @post Warm boot logged if PORF=0 (informational message)
 *
 * @note **Does not modify RSTSR0.** Flag clearing requires protection unlock (PRCR.PRC0=1)
 *       and explicit write to RSTSR0. This function is read-only.
 *
 * @note **Both return values are acceptable.** This check is informational, not a pass/fail test.
 *       Warm boots (PORF=0) are valid in many scenarios (debugger, bootloader, etc.).
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No race conditions.
 *
 * @par Example Usage:
 * @code
 * // Check boot type
 * bool cold_start = internal_check_porf();
 * if (cold_start) {
 *   rx_log_info("MAIN", "Cold start detected (power-on reset)");
 * } else {
 *   rx_log_info("MAIN", "Warm start detected (software/watchdog reset)");
 * }
 * @endcode
 *
 * @see internal_check_startup_flags() Orchestrates all reset flag checks
 * @see internal_check_cwsf() Complementary cold/warm start determination (RSTSR1.7)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify cold start (PORF=1) and warm start (PORF=0) detection
 */
static bool internal_check_porf(void)
{
  const volatile rx_rstsr01_regs_t* regs = rstsr01();

  /* Precondition: Register pointer must be valid (compile-time constant address) */
  RX_ASSERT(regs != nullptr, "RSTSR01 register pointer is nullptr");

  const uint8_t rstsr0_val = regs->rstsr0;

  /* PORF=1 indicates power-on reset occurred, which is expected on normal startup */
  const bool porf_set = (rstsr0_val & k_rstsr0_porf) != 0;

  /* Note: Logging removed - UART not initialized yet. Will be reported by
   * internal_report_startup_flags() after UART is ready. */

  return porf_set;
}

/**
 * @brief Helper function to check if a specific RSTSR2 flag is clear (not set)
 *
 * @details
 * **Generic RSTSR2 flag checker** used by multiple reset detection functions to reduce code duplication.
 * Reads the **RSTSR2 register** and tests if a specific bit (identified by `flag_mask`) is **clear (0)**.
 *
 * ## RSTSR2 (Reset Status Register 2) Overview
 *
 * **Address:** 0x000C0080 (accessed via `rstsr2()` accessor function)
 *
 * **Relevant bit fields:**
 * | Bit | Flag Name | Meaning when SET (1) | Expected State |
 * |-----|-----------|----------------------|----------------|
 * | 0 | **WDTRF** | Watchdog Timer reset occurred | Clear (0) |
 * | 1 | **IWDTRF** | Independent Watchdog Timer reset occurred | Clear (0) |
 * | 2 | **SWRF** | Software reset occurred | Clear (0) |
 *
 * ## Function Usage Pattern
 *
 * This helper is called by three specialized checkers:
 * - `internal_check_iwdtrf()` -> checks IWDTRF (bit 1)
 * - `internal_check_wdtrf()` -> checks WDTRF (bit 0)
 * - `internal_check_swrf()` -> checks SWRF (bit 2)
 *
 * **Why this helper exists:** DRY principle - avoid duplicating register read + mask logic 3 times.
 *
 * ## Algorithm
 *
 * ```
 * 1. Assert flag_mask is non-zero (precondition check)
 * 2. Read RSTSR2 register via rstsr2() accessor
 * 3. Assert register pointer is valid (NULL check)
 * 4. Apply bit mask: result = (rstsr2_val & flag_mask) == 0
 * 5. Return true if flag is CLEAR (0), false if SET (1)
 * ```
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Register read (rstsr2) | ~0.5 us | Single 8-bit read |
 * | Bit masking | ~5 cycles | Bitwise AND + comparison |
 * | Assertions (debug build) | ~0.2 us | Two RX_ASSERT checks |
 * | **Total** | **~0.7 us** | Negligible overhead |
 *
 * @param[in] flag_mask Bit mask for the flag to check (e.g., k_rstsr2_iwdtrf = 0x02)
 *                      Must be non-zero (validated by assertion).
 *
 * @return bool Flag state (clear vs set)
 * @retval true Flag is CLEAR (0) - normal condition, no reset detected
 * @retval false Flag is SET (1) - reset of this type occurred
 *
 * @pre flag_mask must be non-zero (at least one bit set)
 * @pre RSTSR2 register accessible (memory-mapped at 0x000C0080)
 * @pre rstsr2() accessor returns valid pointer (compile-time constant)
 *
 * @post Return value accurately reflects (rstsr2_val & flag_mask) == 0
 * @post No side effects (read-only operation, does not modify RSTSR2)
 *
 * @note **This is a helper function** - not called directly by application code.
 *       Use specialized wrappers (internal_check_iwdtrf, etc.) for clarity.
 *
 * @note **Does not clear flags.** Flag clearing requires protection unlock (PRCR.PRC0=1)
 *       and explicit write to RSTSR2. This function is read-only.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No race conditions.
 *
 * @par Example Usage (Internal):
 * @code
 * // Check Independent Watchdog Timer Reset Flag (IWDTRF)
 * static bool internal_check_iwdtrf(void) {
 *   return internal_check_rstsr2_flag_clear(k_rstsr2_iwdtrf);  // k_rstsr2_iwdtrf = 0x02
 * }
 *
 * // Check Watchdog Timer Reset Flag (WDTRF)
 * static bool internal_check_wdtrf(void) {
 *   return internal_check_rstsr2_flag_clear(k_rstsr2_wdtrf);  // k_rstsr2_wdtrf = 0x01
 * }
 * @endcode
 *
 * @see internal_check_iwdtrf() Check IWDTRF using this helper
 * @see internal_check_wdtrf() Check WDTRF using this helper
 * @see internal_check_swrf() Check SWRF using this helper
 * @see rstsr2() Accessor function for RSTSR2 register
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify correct flag detection for all three flags (IWDTRF, WDTRF, SWRF)
 */
static bool internal_check_rstsr2_flag_clear(const uint8_t flag_mask)
{
  /* Precondition: flag_mask must be non-zero */
  RX_ASSERT(flag_mask != 0, "Precondition: flag_mask must not be zero");

  const volatile uint8_t* reg = rstsr2();

  /* Precondition: Register pointer must be valid (compile-time constant address) */
  RX_ASSERT(reg != nullptr, "RSTSR2 register pointer is nullptr");

  const uint8_t rstsr2_val = *reg;

