Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* Precondition: Register pointer must be valid */
  RX_ASSERT(regs != nullptr, "RSTSR01 register pointer is nullptr");

  /* Read twice to catch unstable/rolling reads from volatile status register. */
  const uint8_t rstsr0_val  = regs->rstsr0;
  const uint8_t rstsr0_val2 = regs->rstsr0;

  RX_ASSERT(rstsr0_val == rstsr0_val2, "Inconsistent RSTSR01 read");

  /* LVD0RF=0 means no voltage-monitoring reset (normal condition) */
  const bool lvd0rf_clear = (rstsr0_val & k_rstsr0_lvd0rf) == 0;

  return lvd0rf_clear;
}

/**
 * @brief Check Cold/Warm Start Determination Flag (CWSF) - Boot type classification
 *
 * @details
 * Reads the **RSTSR1.7 (CWSF)** bit to classify the boot type as **cold start** (power-on,
 * voltage drop) or **warm start** (software reset, watchdog, debugger). This is **informational
 * only** - both cold and warm starts are valid boot conditions.
 *
 * ## CWSF (Cold/Warm Start Flag) Semantics
 *
 * | CWSF Value | Meaning | Boot Classification | Examples |
 * |------------|---------|---------------------|----------|
 * | **0 (clear)** | Cold start | Power-on or voltage recovery | VCC power-on, brownout recovery |
 * | **1 (set)** | Warm start | Processor-initiated reset | Software reset, watchdog, debugger |
 *
 * ## CWSF vs PORF Comparison
 *
 * Both flags classify boot type, but with different granularity:
 *
 * | Flag | Register | Boot Type Distinction | Use Case |
 * |------|----------|----------------------|----------|
 * | **PORF** | RSTSR0.0 | Power-on vs all other resets | Detect fresh power application |
 * | **CWSF** | RSTSR1.7 | Cold (power/voltage) vs warm (processor) | Classify reset mechanism |
 *
 * **Example scenarios:**
 * - **Power-on boot:** PORF=1, CWSF=0 (cold start)
 * - **Brownout recovery:** PORF=0, CWSF=0 (cold start, voltage-related)
 * - **Software reset:** PORF=0, CWSF=1 (warm start, processor-initiated)
 * - **Watchdog reset:** PORF=0, CWSF=1 (warm start, processor-initiated)
 *
 * ## Use Cases for CWSF
 *
 * **Informational (no action required):**
 * 1. **Diagnostics:** Log boot type for debugging and telemetry
 * 2. **Statistics:** Track cold vs warm start frequency (reliability metrics)
 * 3. **State preservation:** Warm start may preserve RAM contents (depends on reset type)
 *
 * **No validation needed:** Unlike IWDTRF (critical) or LVD0RF (hardware issue), CWSF does
 * not indicate an error condition. Both cold and warm starts are valid.
 *
 * ## Return Value Convention
 *
 * **Always returns actual CWSF state:**
 * - `true` = warm start (CWSF=1)
 * - `false` = cold start (CWSF=0)
 *
 * **No error checking:** Caller does not act on return value (informational only).
 *
 * @return bool Boot type classification
 * @retval true Warm start (CWSF=1) - processor-initiated reset (software, watchdog, debugger)
 * @retval false Cold start (CWSF=0) - power-on or voltage recovery
 *
 * @pre RSTSR1 register accessible (memory-mapped at 0x000C001D)
 * @pre rstsr01() accessor returns valid pointer (compile-time constant)
 *
 * @post Return value reflects actual CWSF bit state (0 or 1)
 * @post CWSF bit value validated (must be 0 or k_rstsr1_cwsf via assertion)
 *
 * @note **Both return values are valid boot conditions.** This function is informational only,
 *       not a pass/fail test. No action required based on return value.
 *
 * @note **Does not clear CWSF.** Flag clearing requires protection unlock and explicit write.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context).
 *
 * @par Example Usage (Informational Logging):
 * @code
 * // Log boot type for diagnostics:
 * bool warm_start = internal_check_cwsf();
 * if (warm_start) {
 *   rx_log_info("MAIN", "Warm start detected (processor-initiated reset)");
 *   // Optional: Check other flags to determine specific warm start cause
 *   if (internal_check_swrf()) {
 *     rx_log_info("MAIN", "  -> Software reset (SWRF set)");
 *   } else if (internal_check_wdtrf()) {
 *     rx_log_info("MAIN", "  -> Watchdog reset (WDTRF set)");
 *   }
 * } else {
 *   rx_log_info("MAIN", "Cold start detected (power-on or voltage recovery)");
 * }
 * @endcode
 *
 * @see internal_check_startup_flags() Orchestrates all reset checks (caller)
 * @see internal_check_porf() Complementary power-on reset detection (RSTSR0.0)
 * @see rstsr01() Accessor function for RSTSR0/RSTSR1 registers
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify cold start (CWSF=0) and warm start (CWSF=1) detection
 */
static bool internal_check_cwsf(void)
{
  const volatile rx_rstsr01_regs_t* regs = rstsr01();

  /* Precondition: Register pointer must be valid */
  RX_ASSERT(regs != nullptr, "RSTSR01 register pointer is nullptr");

  const uint8_t rstsr1_val = regs->rstsr1;

  /* Extract CWSF bit value for validation */
  const uint8_t cwsf_raw = (rstsr1_val & k_rstsr1_cwsf);

  /* Postcondition: Verify CWSF bit value is either 0 or k_rstsr1_cwsf */
  RX_ASSERT((cwsf_raw == 0) || (cwsf_raw == k_rstsr1_cwsf),
            "Postcondition: CWSF bit value invalid");

  /* Return actual CWSF state: true for warm start (CWSF=1), false for cold start (CWSF=0) */
  return (cwsf_raw == k_rstsr1_cwsf);
}

/**
 * @brief Report startup flags to UART console after early UART initialization
 *
 * @details
 * Re-reads **reset status registers** and logs diagnostic information now that UART is available.
 * This function is called **after uart_debug_init()** in main() to provide visibility into boot
 * conditions that occurred before UART was initialized.
 *
 * ## Purpose
 *
 * The individual flag check functions (internal_check_porf, etc.) run **before UART init**,
 * so they cannot log to console. This function provides deferred logging of the same information
 * once console output is available.
 *
 * ## Flags Reported
 *
 * | Flag | Register | Meaning | Severity |
 * |------|----------|---------|----------|
 * | **PORF** | RSTSR0.0 | Power-on reset (cold boot) | [INFO] |
 * | **CWSF** | RSTSR1.7 | Cold/warm start classification | [INFO] |
 * | **WDTRF** | RSTSR2.0 | Watchdog timer timeout | [WARN] |
 * | **SWRF** | RSTSR2.2 | Software reset | [INFO] |
 * | **LVD0RF** | RSTSR0.1 | Brownout (voltage drop) | [WARN] |
 * | **IWDTRF** | RSTSR2.1 | Independent watchdog timeout | [N/A - halts before this] |
 *
 * **Note:** IWDTRF is not reported here because if it's set, the system halts via RX_ASSERT
 * in internal_check_startup_flags() before reaching this function.
 *
 * ## Integration with Boot Sequence
 *
 * ```
 * main()
 *   +- internal_check_startup_flags()  // Check flags (silent, UART not ready)
 *   +- rx_clock_power_init()           // Initialize clocks
 *   +- uart_debug_init()               // Initialize UART
 *   +- internal_report_startup_flags() // <- Report flags NOW (UART available)
 *   +- rx_infrastructure_init()        // Continue boot...
 * ```
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Register reads (3 regs) | ~1.5 us | RSTSR0, RSTSR1, RSTSR2 |
 * | Logging (5-6 messages) | ~500 us | UART @ 115200 baud |
 * | **Total** | **~500 us** | Negligible boot overhead |
 *
 * @return void (No return value - informational logging only)
 *
 * @pre uart_debug_init() called successfully (UART functional)
 * @pre RSTSR0/RSTSR1/RSTSR2 registers accessible (memory-mapped)
 *
 * @post Startup flags logged to UART console for diagnostics
 * @post No side effects (read-only operation, does not clear flags)
 *
 * @note **Call this function ONLY if uart_debug_init() succeeded.** If UART init failed,
 *       skip this function to avoid silent log failures.
 *
 * @note **Does not clear reset flags.** Flags remain set until explicitly cleared by
 *       firmware or next power-on reset.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No race conditions.
 *
 * @par Example Usage:
 * @code
 * // In main():
 * rx_err_t ret = uart_debug_init();
 * if (ret == k_rx_ok) {
 *   internal_report_startup_flags();  // Safe: UART initialized
 * }
 * RX_ERROR_CHECK(ret);  // Check UART status after reporting
 * @endcode
 *
 * @see internal_check_startup_flags() Validates flags (runs before UART init)
 * @see uart_debug_init() Must be called before this function
 * @see rstsr01() Accessor for RSTSR0/RSTSR1 registers
 * @see rstsr2() Accessor for RSTSR2 register
 *
 * @since Version 1.0.0
 */
static void internal_report_startup_flags(void)
{
  const volatile rx_rstsr01_regs_t* regs01 = rstsr01();
  const volatile uint8_t*           regs2  = rstsr2();

  /* Preconditions: Register pointers must be valid */
  RX_ASSERT(regs01 != nullptr, "RSTSR01 register pointer is nullptr");
  RX_ASSERT(regs2 != nullptr, "RSTSR2 register pointer is nullptr");

  const uint8_t rstsr0_val = regs01->rstsr0;
  const uint8_t rstsr1_val = regs01->rstsr1;
  const uint8_t rstsr2_val = *regs2;

  /* Report power-on reset flag (PORF) */
  if (rstsr0_val & k_rstsr0_porf) {
    rx_log_info("BOOT", "Cold boot - Power-on reset detected (PORF=1)");
  } else {
    rx_log_info("BOOT", "Warm boot - No power-on reset (PORF=0)");
  }

  /* Report cold/warm start flag (CWSF) */
  if (rstsr1_val & k_rstsr1_cwsf) {
    rx_log_info("BOOT", "Warm start - Processor-initiated reset (CWSF=1)");
  } else {
    rx_log_info("BOOT", "Cold start - Power/voltage related (CWSF=0)");
  }

  /* Report abnormal conditions */
  if (rstsr2_val & k_rstsr2_wdtrf) {
    rx_log_warn("BOOT", "Watchdog Timer timeout reset detected (WDTRF=1)");
    rx_log_warn("BOOT", "  -> Check for firmware hang or intentional WDT reset");
  }

