Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* Register i2c1_baro - BMP280 barometric sensor (RIIC1, addr 0x76, SDA=P2.0, SCL=P2.1) */
  err = rx_bus_config_init_i2c(&s_i2c1_baro_config,
                               "i2c1_baro",             /* name: matches rx_bmp280.c s_bus_name */
                               k_riic_channel_1,        /* channel: RIIC1 (same as i2c1_imu) */
                               k_i2c_addr_bmp280,       /* device_addr: BMP280 (SDO=LOW) */
                               k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                               k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                               k_i2c_frequency_400khz); /* frequency_hz: 400 kHz fast mode */
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c1_baro_config);
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) registration must succeed");
  err = rx_bus_i2c_init(&g_bus_manager, "i2c1_baro");
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) I2C init must succeed");
}

/**
 * @brief Initialize shared data module and hardware watchdog timer
 *
 * @details
 * Sets up inter-task communication (ThreadX mutexes and event flags via shared_data_init)
 * and initializes the Independent Watchdog Timer with state-dependent timeouts.
 *
 * @pre internal_register_system_buses() completed (buses available for tasks)
 * @pre ThreadX kernel initialized (mutex/event-flag creation available)
 *
 * @post Shared data mutexes and event flags created and ready for task use
 * @post IWDT hardware configured with s_iwdt_config parameters
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see shared_data_init() Inter-task communication setup
 * @see rx_iwdt_init() Hardware watchdog initialization
 *
 * @since Version 1.0.0
 */
static void internal_init_shared_data_and_watchdog(void)
{
  /* Initialize shared data module (mutexes, event flags) */
  rx_err_t err = shared_data_init();
  RX_ASSERT(err == k_rx_ok, "shared_data_init must succeed");

  /* Initialize IWDT (hardware watchdog + task monitoring) */
  err = rx_iwdt_init(&s_iwdt_config);
  RX_ASSERT(err == k_rx_ok, "rx_iwdt_init must succeed");
}

/**
 * @brief Register all eight tasks for IWDT heartbeat monitoring and set initial state
 *
 * @details
 * Registers each application task with the IWDT module so that missed heartbeats
 * are detected. Timeouts are set to 3x the nominal task period to allow two
 * missed heartbeats before a timeout is declared.
 *
 * Task timeout mapping:
 * - Telemetry (50ms period) -> 150ms timeout
 * - LED Status (50ms period) -> 150ms timeout
 * - Temp Sensor (1000ms period) -> 3000ms timeout
 * - Obstacle Detect (20ms period) -> 60ms timeout
 * - Motor Control (10ms period) -> 30ms timeout
 * - Communication (10ms period) -> 30ms timeout
 * - Watchdog Monitor (10ms period) -> 30ms timeout
 *
 * After all tasks are registered the system state is set to k_system_state_init
 * so the IWDT uses the 5-second init-phase timeout.
 *
 * @pre internal_init_shared_data_and_watchdog() completed (IWDT initialized)
 * @pre No tasks registered yet (first call after rx_iwdt_init)
 *
 * @post All eight tasks registered with per-task heartbeat timeouts
 * @post IWDT system state set to k_system_state_init (5s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_iwdt_register_task() Registers a single task for monitoring
 * @see rx_iwdt_set_state() Sets system state for state-dependent timeouts
 *
 * @since Version 1.0.0
 */
static void internal_register_iwdt_tasks(void)
{
  rx_err_t err = rx_iwdt_register_task("Telemetry", k_iwdt_task_timeout_telemetry_ms);
  RX_ASSERT(err == k_rx_ok, "Telemetry IWDT registration must succeed");

  err = rx_iwdt_register_task("LEDStatus", k_iwdt_task_timeout_ledstatus_ms);
  RX_ASSERT(err == k_rx_ok, "LEDStatus IWDT registration must succeed");

  err = rx_iwdt_register_task("TempSensor", k_iwdt_task_timeout_tempsensor_ms);
  RX_ASSERT(err == k_rx_ok, "TempSensor IWDT registration must succeed");

  err = rx_iwdt_register_task("ObstDetect", k_iwdt_task_timeout_obstdetect_ms);
  RX_ASSERT(err == k_rx_ok, "ObstDetect IWDT registration must succeed");

  err = rx_iwdt_register_task("MotorCtrl", k_iwdt_task_timeout_motorctrl_ms);
  RX_ASSERT(err == k_rx_ok, "MotorCtrl IWDT registration must succeed");

  err = rx_iwdt_register_task("CommTask", k_iwdt_task_timeout_commtask_ms);
  RX_ASSERT(err == k_rx_ok, "CommTask IWDT registration must succeed");

  err = rx_iwdt_register_task("WatchdogMon", k_iwdt_task_timeout_watchdog_ms);
  RX_ASSERT(err == k_rx_ok, "WatchdogMon IWDT registration must succeed");

  err = rx_iwdt_register_task("ImuTask", k_iwdt_task_timeout_imu_ms);
  RX_ASSERT(err == k_rx_ok, "ImuTask IWDT registration must succeed");

  /* Set initial IWDT state (init phase - 5s timeout) */
  err = rx_iwdt_set_state(k_system_state_init);
  RX_ASSERT(err == k_rx_ok, "IWDT set init state must succeed");
}

/**
 * @brief Create all eight application tasks and transition to running state
 *
 * @details
 * Creates all eight ThreadX tasks in dependency-aware order (lowest priority
 * first, except Watchdog Monitor which follows Communication for logical
 * grouping). Tasks do not begin executing until tx_application_define()
 * returns and the scheduler starts. After all tasks are created, the IWDT
 * system state transitions to k_system_state_running.
 *
 * Task creation order:
 * 1. Telemetry (priority 18, lowest)
 * 2. LED Status (priority 17)
 * 3. Temperature Sensor (priority 15)
 * 4. IMU (priority 13, BNO055 + BMP280)
 * 5. Obstacle Detection (priority 12)
 * 6. Motor Control (priority 8)
 * 7. Communication (priority 5)
 * 8. Watchdog Monitor (priority 6)
 *
 * @pre internal_register_iwdt_tasks() completed (all tasks registered for monitoring)
 * @pre Static task stacks allocated in each task module
 *
 * @post All eight ThreadX threads created in READY state
 * @post IWDT system state set to k_system_state_running (2s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 * @note Tasks do not begin executing until tx_application_define() returns.
 *
 * @see telemetry_task_create() through watchdog_monitor_task_create()
 * @see rx_iwdt_set_state() Transitions to running state after task creation
 *
 * @since Version 1.0.0
 */
static void internal_create_system_tasks(void)
{
  /* Beacon: drive PB3 LOW at the VERY START so AD2 on P4 pad 2 can
   * tell whether we reached task creation at all.  If AD2 still reads
   * HIGH after flash, internal_create_system_tasks never ran
   * (something earlier in tx_application_define asserted). */
  {
    volatile uint8_t* const pb_podr_beacon = (volatile uint8_t*)0x0008C02BU;
    *pb_podr_beacon &= (uint8_t)~(1U << 3);
  }

  /* Telemetry Task - Priority 18 (lowest) */
  rx_err_t err = telemetry_task_create();
  RX_ASSERT(err == k_rx_ok, "telemetry_task_create must succeed");

