Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* ========================================================================
   * EARLY UART INITIALIZATION - Enable error logging ASAP
   * ======================================================================== */
  ret = uart_debug_init();

  /* Report startup flags to console (only if UART initialized successfully) */
  if (ret == k_rx_ok) {
    internal_report_startup_flags();
  }

  /* Now check UART init status - will halt if failed, but at least tried to report flags */
  RX_ERROR_CHECK(ret);

  /* Initialize infrastructure (error handler + pin validator) before peripherals.
   * Must run in single-threaded context before ThreadX starts. */
  ret = rx_infrastructure_init();
  RX_ERROR_CHECK(ret);

  /* Initialize application-specific hardware (GPIO, GPTW, timers, UART, SPI, I2C, ADC) */
  ret = hardware_init();
  RX_ERROR_CHECK(ret);

  /* Inline USB0 attach that is known to bring up DPRPU successfully on
   * this board.  The equivalent rx_usb_hw_init path with busy-wait
   * delays has been observed to assert DPRPU without SETUP ever being
   * serviced -- rootcause is open, but this sequence from
   * usb_test/hoco_pid_fix.c works reliably.  After attach we drive the
   * production rx_usb_isr_handler from a tight poll loop so SETUP is
   * serviced via the real rx_usb_cdc descriptors (3-port CDC composite,
   * 207-byte config) -- not the stub handler we previously embedded
   * here. */
  {
    volatile uint16_t* const PRCR_R    = (volatile uint16_t*)0x000803FEU;
    volatile uint32_t* const MSTPCRB_R = (volatile uint32_t*)0x00080014U;
    volatile uint16_t* const SYSCFG_R  = (volatile uint16_t*)0x000A0000U;
    volatile uint16_t* const INTENB0_R = (volatile uint16_t*)0x000A0030U;
    volatile uint16_t* const BRDYENB_R = (volatile uint16_t*)0x000A0036U;
    volatile uint16_t* const BEMPENB_R = (volatile uint16_t*)0x000A003AU;
    volatile uint16_t* const DCPCFG_R  = (volatile uint16_t*)0x000A005CU;
    volatile uint16_t* const DCPMAXP_R = (volatile uint16_t*)0x000A005EU;
    volatile uint16_t* const DCPCTR_R  = (volatile uint16_t*)0x000A0060U;

    *PRCR_R     = 0xA503U;
    *MSTPCRB_R &= ~(1UL << 19);
    *PRCR_R     = 0xA500U;

    *SYSCFG_R   = 0x0000U;
    for (volatile uint32_t d = 0; d < 2400000U; d++) { __asm__ volatile("nop"); }
    *SYSCFG_R  |= (1U << 0);  /* USBE */
    *SYSCFG_R  |= (1U << 10); /* SCKE */
    for (volatile uint32_t d = 0; d < 2400000U; d++) { __asm__ volatile("nop"); }

    *DCPCFG_R   = 0x0000U;
    *DCPMAXP_R  = 64U;
    *DCPCTR_R   = 0x0001U;
    *BRDYENB_R  = 0x0001U;
    *BEMPENB_R  = 0x0001U;
    *INTENB0_R  = (uint16_t)((1U << 15) | (1U << 12) | (1U << 11) | (1U << 10) | (1U << 8));

    *SYSCFG_R  |= (1U << 4); /* DPRPU */

    /* Enable CPU ICU delivery for vector 36 (USB0 USBI) so BRDY/BEMP
     * interrupts fire directly -- now safe because cmt0_isr is in
     * .rvectors (real ThreadX tick works) and usb0_usbi_isr is also
     * in .rvectors via its own interrupt(".rvectors", 36) attribute. */
    volatile uint8_t*  const IPR36_R = (volatile uint8_t*)(0x00087300U + 36U);
    volatile uint8_t*  const IR36_R  = (volatile uint8_t*)(0x00087000U + 36U);
    volatile uint8_t*  const IER4_R  = (volatile uint8_t*)(0x00087204U);
    *IR36_R  = 0U;
    *IPR36_R = 12U;
    *IER4_R |= (uint8_t)(1U << 4); /* vector 36 = IER[4] bit 4 */

    /* Diagnostic: drive PB3 (P4 pad 2, MCU pin 82, silkscreen EN3D)
     * HIGH here in main BEFORE tx_kernel_enter.  usb_task later drives
     * it LOW.  AD2 DIO7 probe on P4 pad 2 thus shows:
     *   HIGH = firmware reached main init but usb_task hasn't run
     *   LOW  = usb_task ran and set PB3 low
     *   0x0  = neither wrote (probe/wiring issue) */
    volatile uint8_t* const pb_pdr  = (volatile uint8_t*)0x0008C00BU;
    volatile uint8_t* const pb_podr = (volatile uint8_t*)0x0008C02BU;
    volatile uint8_t* const pb_pmr  = (volatile uint8_t*)0x0008C06BU;
    *pb_pmr  &= (uint8_t)~(1U << 3);
    *pb_pdr  |= (uint8_t)(1U << 3);
    *pb_podr |= (uint8_t)(1U << 3); /* HIGH */
  }

  /* Hardware is now fully attached by the inline sequence above.  Tell
   * the production rx_usb_hw layer that s_hw_initialized = true so
   * rx_usb_init below skips the redundant register sequence, then call
   * rx_usb_init() to set up ring buffers, CDC class state, and flip
   * s_usb.initialized = true.  Without this, rx_usb_write() early-exits
   * with k_rx_err_invalid_state and telemetry never reaches the host. */
  rx_usb_hw_mark_initialized();
  ret = rx_usb_init(nullptr);
  RX_ERROR_CHECK(ret);

  /* Service SETUP inline via the production dispatcher during the
   * ThreadX boot gap.  rx_usb_isr_handler routes CTRT into
   * rx_usb_cdc_handle_setup, which serves the real 3-port CDC composite
   * descriptor (207-byte config) -- so the host sees CDC interfaces and
   * creates one ttyACM per port.  ALSO: once SET_CONFIGURATION has set
   * the device state to configured, repeatedly write 'Z' to pipe 1
   * (port 0 bulk IN, EP 0x81) via raw registers.  If the host sees
   * "ZZZZ..." on /dev/ttyACM1 during this pre-kernel window, the
   * hardware itself transmits fine and the bug is RTOS-side. */
  /* Pre-kernel SETUP-servicing window.  Spin polling rx_usb_isr_handler
   * so the host's enumeration (GET_DESCRIPTOR / SET_ADDRESS /
   * SET_CONFIGURATION) completes inside Linux's retry deadline.
   * 1M iterations is enough for full FS enumeration (~10ms wall clock
   * on this Pi 5) without burning ~80s of dead time before
   * tx_kernel_enter takes over. */
  for (uint32_t spin = 0U; spin < 1000000U; spin++) {
    rx_usb_isr_handler();
  }

  /* Start the ThreadX scheduler - should never return */
  tx_kernel_enter();

  /* Should never reach here, ThreadX scheduler failed to start if it does */
  while (1) {
    __asm__ volatile("wait"); /* Wait for sleep/idle */
  }

  /* Unreachable: ThreadX scheduler takes over before reaching this point.
   * If execution reaches here, the system is in an undefined state. */
  __builtin_unreachable();

  return k_main_ret_success;
}
